#+TITLE: Week 4.27 Math Homework
#+AUTHOR: 2024110144 陈有骏
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{xeCJK}
#+OPTIONS: \n:t toc:nil num:nil date:nil

#+begin_comment
4.27 Thomas 16.1 1-46 mod 6
left: 24 42 (both failed to integrate)
4.28 Thomas 16.2 1-60 mod 6
left: 54 (failed to integrate)
5.7 Thomas 16.5 1-56 mod 6
left: nil
Thomas 16.6 1-48 mod 6
left: 24 30 36 42 48
5.9 导论下 7.6 1,2
left: 1 2
#+end_comment

** 60
$$\vec{F}=(x^2y)\vec{i}+\frac{1}{3}x^3\vec{j}+xy\vec{k}$$
$$\vec{r}(t)=(\cos t)\vec{i}+(\sin t)\vec{j}+(2\sin^2 t - 1)\vec{k}$$
where $0\leq t\leq 2\pi$
#+begin_src octave :results output :exports both
  pkg load symbolic
  syms t
  x = cos(t)
  y = sin(t)
  z = (2 * sin(t)^2 - 1)
  r = [x, y, z]
  F = [x^2 * y, 1/3 * x^3, x * y]
  diff_r = diff (r, t, 1)
  F_along_path = F * diff_r'
  flux = int (F_along_path, t, [0, 2*pi])
#+end_src

#+RESULTS:
#+begin_example
Symbolic pkg v3.2.1: Python communication link active, SymPy v1.13.3.
x = (sym) cos(t)
y = (sym) sin(t)
z = (sym)

       2       
  2⋅sin (t) - 1

r = (sym 1×3 matrix)

  ⎡                     2       ⎤
  ⎣cos(t)  sin(t)  2⋅sin (t) - 1⎦

F = (sym 1×3 matrix)

  ⎡                   3                  ⎤
  ⎢          2     cos (t)               ⎥
  ⎢sin(t)⋅cos (t)  ───────  sin(t)⋅cos(t)⎥
  ⎣                   3                  ⎦

diff_r = (sym) [-sin(t)  cos(t)  4⋅sin(t)⋅cos(t)]  (1×3 matrix)
F_along_path = (sym)

                                                               3       ⎛_⎞
              ⎛_⎞    2                  ⎛_⎞           ⎛_⎞   cos (t)⋅cos⎝t⎠
  - sin(t)⋅sin⎝t⎠⋅cos (t) + 4⋅sin(t)⋅sin⎝t⎠⋅cos(t)⋅cos⎝t⎠ + ──────────────
                                                                  3       

flux = (sym) π
#+end_example

:note:
the last symbol $\pi$ in unicode is not shown in pdf export
but it is $pi$
you might check this at the source file by following this link:
[[https://github.com/Flurando/homework/blob/main/math/2025/4.27/homework.org][https://github.com/Flurando/homework/blob/main/math/2025/4.27/homework.org]]
:end:

